test/upward_seepage/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  walls
  {
    type            zeroGradient;
  }
  outlet
  {
    type            totalPressure;
    p0              uniform 0;
    U               U;
    phi             phi;
    rho             rho;
    psi             none;
    gamma           1;
    value           uniform 0;
  }
  frontAndBack
  {
    type            empty;
  }
}
